{
  "summary": "Results-driven Software Engineer with an M.S. in Computer Science and expertise in developing and deploying high-quality, maintainable software. Proficient in Java, Python, and C++, with experience in Spring Boot, PyTorch, and Agile methodologies.  Adept at optimizing code for performance and collaborating effectively within diverse teams.",
  "experience": [
    {
      "company": "Cognizant Technology Solutions",
      "location": "Chennai, Tamil Nadu, India",
      "title": "Software Developer",
      "dates": "March 2023 - Aug 2023",
      "points": [
        "Developed and deployed 5 full-stack features for enterprise systems using Spring Boot (Java) and modern front-end frameworks, resulting in extensible and maintainable code.",
        "Collaborated with stakeholders to translate user requirements into technical specifications within an Agile environment, improving API response times by 15%."
      ]
    },
    {
      "company": "Cognizant Technology Solutions",
      "location": "Chennai, Tamil Nadu, India",
      "title": "Programmer Analyst Intern",
      "dates": "March 2022-Sept 2022",
      "points": [
        "Identified and resolved 100+ bugs in enterprise applications, resulting in a 10% reduction in reported issues for critical modules.",
        "Improved code quality and reliability by authoring technical documentation and augmenting test automation."
      ]
    }
  ],
  "projects": [
    {
      "name": "Real-time Hand Tracking & Gesture Recognition for AR",
      "dates": "Jan 2024-May 2025",
      "points": [
        "Developed a deep learning model (C++, PyTorch) for high-fidelity hand tracking in a simulated AR environment, achieving 98.5% accuracy on a dataset of 50 complex gestures.",
        "Engineered a lightweight architecture with data augmentation, reducing latency by 30% and increasing model robustness by 25% for 90 FPS on-device performance."
      ]
    },
    {
      "name": "Enterprise-Level Software System Enhancement",
      "dates": "Jun 2024 - Present",
      "points": [
        "Improved the performance of a critical enterprise system by refactoring core components, resulting in a 20% reduction in processing time and a 15% decrease in resource consumption.",
        "Implemented a new monitoring system that reduced error rates by 10% and facilitated proactive issue resolution."
      ]
    },
    {
      "name": "Automated Code Quality Improvement System",
      "dates": "Sep 2023-Dec 2023",
      "points": [
        "Developed an automated code review system that identified and flagged 80% of common code quality issues, saving 10 hours per week in manual review time.",
        "Integrated this system into the CI/CD pipeline, improving overall code quality and reducing bug occurrences by 5%."
      ]
    }
  ]
}