{
  "summary": "Results-driven Software Engineer with MS in CS and expertise in optimizing CI/CD pipelines and developer workflows.  Proficient in Python, experienced with Kubernetes, and passionate about improving developer experience through automation and tooling.  Seeking to leverage skills to accelerate software delivery at HeyGen.",
  "experience": [
    {
      "company": "Cognizant Technology Solutions",
      "location": "Chennai, Tamil Nadu, India",
      "title": "Software Developer",
      "dates": "March 2023 - Aug 2023",
      "points": [
        "Developed and deployed full-stack features for enterprise systems using Spring Boot (Java) and modern front-end frameworks, resulting in 15% faster API response times.",
        "Collaborated with product stakeholders to translate user requirements into technical specifications within an Agile environment, delivering robust and maintainable solutions."
      ]
    },
    {
      "company": "Cognizant Technology Solutions",
      "location": "Chennai, Tamil Nadu, India",
      "title": "Programmer Analyst Intern",
      "dates": "March 2022-Sept 2022",
      "points": [
        "Identified and resolved bugs in enterprise applications, reducing reported issues by 10% for key modules.",
        "Improved code quality and reliability by authoring technical documentation and enhancing test automation."
      ]
    }
  ],
  "projects": [
    {
      "name": "Automated CI/CD Pipeline for Microservices",
      "dates": "Jan 2024-May 2025",
      "points": [
        "Designed and implemented a high-performance CI/CD pipeline using GitHub Actions and Kubernetes, reducing deployment time by 40% and increasing reliability by 25%.",
        "Integrated automated testing and deployment strategies, resulting in a 30% reduction in deployment failures."
      ]
    },
    {
      "name": "DevOps Tooling for Enhanced Developer Workflow",
      "dates": "Jun 2024 - Present",
      "points": [
        "Developed internal tools using Python and Bash scripting to automate repetitive tasks, improving developer efficiency by 20%.",
        "Created a self-service platform for provisioning development environments, reducing setup time for new developers by 50%."
      ]
    },
    {
      "name": "Optimized Docker Image Builds for Faster Feedback Loops",
      "dates": "Sep 2023-Dec 2023",
      "points": [
        "Reduced Docker image sizes by 60% through multi-stage builds and optimized dependency management, resulting in faster build and deployment times.",
        "Improved build infrastructure scalability by migrating to a Kubernetes-based solution, handling 2x the concurrent builds."
      ]
    }
  ]
}