{
  "summary": "Results-oriented AI/CV Engineer with an M.S. in Computer Science and expertise in migrating applications. Proven ability to optimize on-device performance and improve model accuracy.  Proficient in Python, C++, PyTorch and experienced in developing and deploying deep learning models for AR/VR applications.  Seeking a Lead OCP Engineer role within the Financial Services industry.",
  "experience": [
    {
      "company": "Cognizant Technology Solutions",
      "location": "Chennai, Tamil Nadu, India",
      "title": "Software Developer",
      "dates": "March 2023 - Aug 2023",
      "points": [
        "Developed and deployed full-stack features for enterprise systems using Spring Boot (Java) and modern front-end frameworks, ensuring extensible, maintainable, high-quality code.",
        "Collaborated in an Agile team, translating user requirements into technical specifications and delivering robust solutions; improved API response times by 15%."
      ]
    },
    {
      "company": "Cognizant Technology Solutions",
      "location": "Chennai, Tamil Nadu, India",
      "title": "Programmer Analyst Intern",
      "dates": "March 2022-Sept 2022",
      "points": [
        "Improved enterprise application stability by identifying and fixing bugs, resulting in a 10% reduction in reported issues.",
        "Enhanced code quality and reliability through technical documentation and improved test automation."
      ]
    }
  ],
  "projects": [
    {
      "name": "Migration of Legacy Financial Application to OCP",
      "dates": "Jan 2024-May 2025",
      "points": [
        "Led the successful migration of a legacy financial application (100k+ lines of code) from PCF to OCP, resulting in a 20% reduction in infrastructure costs and a 15% improvement in application performance.",
        "Implemented robust monitoring and alerting systems, ensuring 99.9% application uptime post-migration.  Successfully managed a team of 5 engineers throughout the project lifecycle."
      ]
    },
    {
      "name": "On-Device 3D Scene Reconstruction for VR | Personal Project",
      "dates": "Jun 2024 - Present",
      "points": [
        "Developed a custom SLAM algorithm that decreased tracking drift by 40% compared to baseline methods for large-scale environments.",
        "Optimized the system for resource-constrained mobile hardware, achieving a 2.5x speedup in mesh generation enabling interactive on-device performance."
      ]
    },
    {
      "name": "High-Performance Computing Cluster for Financial Modeling",
      "dates": "Sep 2023-Dec 2023",
      "points": [
        "Designed and implemented a high-performance computing cluster using Kubernetes, enabling a 5x speedup in complex financial model simulations.",
        "Successfully deployed and managed the cluster, achieving 99.99% uptime, reducing model processing time by 80%."
      ]
    }
  ]
}