{
  "summary": "Results-oriented AI/Computer Vision Engineer proficient in C++ and Python (PyTorch) with experience developing and deploying high-performance deep learning models for AR/VR applications.  Adept at optimizing on-device performance, improving model accuracy, and collaborating within Agile teams to deliver robust solutions.  Experienced in full-stack development and troubleshooting complex technical issues.",
  "experience": [
    {
      "company": "Cognizant Technology Solutions",
      "location": "Chennai, Tamil Nadu, India",
      "title": "Software Developer",
      "dates": "March 2023 - Aug 2023",
      "points": [
        "Developed and deployed full-stack features for enterprise systems using Spring Boot (Java) and modern front-end frameworks, emphasizing extensible, maintainable code.",
        "Collaborated in an Agile team, translating user requirements into technical specifications and improving API response times by 15%."
      ]
    },
    {
      "company": "Cognizant Technology Solutions",
      "location": "Chennai, Tamil Nadu, India",
      "title": "Programmer Analyst Intern",
      "dates": "March 2022-Sept 2022",
      "points": [
        "Improved code quality and reliability by identifying and fixing bugs in enterprise applications, resulting in a 10% reduction in reported issues.",
        "Enhanced test automation and authored technical documentation to improve software quality."
      ]
    }
  ],
  "projects": [
    {
      "name": "Real-time Hand Tracking & Gesture Recognition for AR",
      "dates": "Jan 2024-May 2025",
      "points": [
        "Developed a novel deep learning model (C++, PyTorch) for high-fidelity hand tracking in a simulated AR environment, achieving 98.5% accuracy on a custom dataset.",
        "Engineered a lightweight architecture, reducing latency by 30% and increasing model robustness by 25% to achieve 90 FPS on-device performance."
      ]
    },
    {
      "name": "On-Device 3D Scene Reconstruction for VR",
      "dates": "Jun 2024 - Present",
      "points": [
        "Architected a 3D reconstruction pipeline in Python, creating a custom SLAM algorithm that decreased tracking drift by 40% compared to baseline methods.",
        "Optimized the system for mobile hardware, achieving a 2.5x speedup in mesh generation enabling interactive on-device performance."
      ]
    },
    {
      "name": "Enterprise-Grade Bug Tracking System",
      "dates": "Sep 2023-Dec 2023",
      "points": [
        "Developed a web application using Spring Boot and React to track and manage software bugs, improving team efficiency by 15%.",
        "Integrated the system with GitHub and Jenkins for seamless workflow management, enhancing developer productivity."
      ]
    }
  ]
}