{
  "id": 1,
  "user_id": 1,
  "name": "Sanaharika Thallada",
  "email": "sanaharikathallada@gmail.com",
  "phone": "217-775-5653",
  "linkedin": "https://www.linkedin.com/in/yashwanthtirupati/",
  "github": "",
  "summary": "Results-oriented software engineer with expertise in Python, microservices, and machine learning, seeking to leverage skills in building scalable SaaS applications at Comcast.",
  "education": [
    {
      "university": "Saint Louis University",
      "location": ", Saint Louis, Missouri",
      "degree": "Master of Science, Information Systems",
      "dates": "Aug 2023 – May2025",
      "details": []
    }
  ],
  "experience": [
    {
      "title": "Full-Stack Java Developer",
      "company": "Cognizant Technology Solutions",
      "location": "Hyderabad",
      "dates": "Aug 2020 – Jul 2023",
      "points": [
        "Developed and maintained Java-based applications, resulting in a 15% increase in system efficiency.",
        "Collaborated with cross-functional teams to deliver projects on time and within budget, consistently exceeding expectations.",
        "Implemented automated testing frameworks, improving software quality and reducing bug counts by 20%."
      ]
    },
    {
      "title": "Intern – Programmer Analyst",
      "company": "Cognizant Technology Solutions",
      "location": "Pune, Maharastra",
      "dates": "Jan 2020 – May 2020",
      "points": [
        "Designed and implemented a Python script to automate data processing, improving data accuracy by 10%.",
        "Contributed to the development of a new software module, enhancing system functionality and user experience.",
        "Successfully debugged and resolved critical production issues, minimizing downtime and ensuring system stability."
      ]
    }
  ],
  "projects": [
    {
      "name": "DataBee Microservice Development",
      "dates": "2023-2024",
      "points": [
        "Developed and deployed five high-performance analytical microservices for DataBee, a SaaS security platform, using Python and Docker.",
        "Implemented machine learning algorithms to enhance threat detection capabilities, resulting in a 10% reduction in false positives.",
        "Integrated with various data sources to ingest and process large cyber datasets, improving data quality and analysis efficiency.",
        "Utilized Agile Scrum methodologies to collaborate effectively with cross-functional teams and meet project deadlines."
      ]
    },
    {
      "name": "Cybersecurity Data Analysis Platform",
      "dates": "2022-2023",
      "points": [
        "Built a scalable data analytics platform using Python and cloud technologies to process and analyze large volumes of cybersecurity data.",
        "Developed custom algorithms for anomaly detection and threat hunting, improving the accuracy of security alerts.",
        "Integrated with existing security tools and dashboards to provide real-time threat intelligence and insights.",
        "Implemented robust security measures to protect sensitive data and maintain compliance with industry standards."
      ]
    },
    {
      "name": "SaaS Application Security Enhancement",
      "dates": "2022",
      "points": [
        "Enhanced the security features of an existing SaaS application by implementing robust authentication and authorization mechanisms.",
        "Improved the application's resilience to attacks by implementing security best practices and threat modeling techniques.",
        "Reduced the application's vulnerability to common security exploits by 25% through code refactoring and security audits.",
        "Collaborated with security engineers to design and implement a comprehensive security testing program."
      ]
    }
  ],
  "skills": {
    "Languages & Frameworks": "Java, C, C++, Spring Boot, Hibernate, Angular2/4/8, React, Node.js, JSP, Servlets, MVC",
    "Frontend": "HTML5, CSS3, JavaScript, jQuery, JSON, XML, XSLT",
    "Web Services": "REST , SOAP",
    "Cloud &DevOps": "AWS, Azure, Docker, Google cloud",
    "Tools": "Jira, Confluence, GitHub,GitLab, Postman, Elasticsearch",
    "Database": "MySQL",
    "Messaging Queues": "ActiveMQ, RabbitMQ",
    "Security": "OAuth2, JWT, Spring Security"
  },
  "activities": [],
  "last_updated": "2025-06-23 07:55:28"
}